""" Задача 12: Для натурального n создать словарь индекс-значение, состоящий 
из элементов последовательности 3n + 1. 
- Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}"""

""" 
Решение 1
n = int(input('введите число '))
slovar = {}
for i in range(1, n+1):
    slovar.update({i:3*i+1})
     
print(slovar) """

#Решение 2
n = int(input('введите число '))

print("{", end = " ")
for i in range(1, n):
    print(i,":", 3*i+1, end=", ")
print(n,":", 3*n+1, "}")
